Revit 2027 API
ParameterTypeId.EnergyAnalysisHvacSystem Property
 "HVAC System": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisHvacSystem { get; }
Public Shared ReadOnly Property EnergyAnalysisHvacSystem As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisHvacSystem {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisHvacSystem : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace